commands_templates/GetDoorInfoList0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/doorcontrol/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:GetDoorInfoList>
         <!--Optional:-->
         <!--type: int-->
         <wsdl:Limit>?</wsdl:Limit>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:StartReference>?</wsdl:StartReference>
      </wsdl:GetDoorInfoList>
   </soap:Body>
</soap:Envelope>